## dev plan
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.lambda.aws_lambda_function.output_event_message will be updated in-place
  ~ resource "aws_lambda_function" "output_event_message" {
        id                             = "dev-edp-output-event-message"
      ~ last_modified                  = "2022-05-16T09:15:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "j9OdZkAsBF3u43XUToRqTqeSKIj8q0xvZN4drK0It5Y=" -> (known after apply)
        tags                           = {}
        # (20 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.lambda.module.lambda_python_dependencies.data.archive_file.lambda_generated_zip_file will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda_generated_zip_file"  {
      ~ id                  = "8a68a08b34fcee2ee67c05f4f7e1997aa4c38813" -> (known after apply)
      ~ output_base64sha256 = "j9OdZkAsBF3u43XUToRqTqeSKIj8q0xvZN4drK0It5Y=" -> (known after apply)
      ~ output_md5          = "390029e3cc13fe3210395c996ce6c026" -> (known after apply)
      ~ output_path         = "../../files/python_lambda_package/package.zip" -> (known after apply)
      ~ output_sha          = "8a68a08b34fcee2ee67c05f4f7e1997aa4c38813" -> (known after apply)
      ~ output_size         = 2040071 -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.lambda.module.lambda_python_dependencies.data.null_data_source.packaging_changes will be read during apply
  # (config refers to values not yet known)
 <= data "null_data_source" "packaging_changes"  {
      ~ has_computed_default = "default" -> (known after apply)
      ~ id                   = "static" -> (known after apply)
      ~ inputs               = {
          ~ "null_id"      = "6178199574254897682" -> (known after apply)
            # (1 unchanged element hidden)
        }
      ~ outputs              = {
-           "null_id"      = "6178199574254897682"
-           "package_path" = "../../files/python_lambda_package/package.zip"
        } -> (known after apply)
      ~ random               = "8192819909479770418" -> (known after apply)
    }

  # module.lambda.module.lambda_python_dependencies.aws_s3_object.lambda_generated_zip_file will be updated in-place
  ~ resource "aws_s3_object" "lambda_generated_zip_file" {
      ~ etag               = "390029e3cc13fe3210395c996ce6c026" -> (known after apply)
        id                 = "dev/lambda/generated/output_event_message.zip"
      ~ source             = "../../files/python_lambda_package/package.zip" -> (known after apply)
        tags               = {}
      ~ version_id         = ".SNTDzMBUFIbmIRNnv16pblQ68AAnBGE" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.lambda.module.lambda_python_dependencies.null_resource.packaging must be replaced
-/+ resource "null_resource" "packaging" {
      ~ id       = "6178199574254897682" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "src_hash" = "b46120599dcca4d1d2bfddd528534135b202228e" -> "0ce7d7024dadc9db2f4611af96acc604c6e27279"
        }
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```